ir_version: 3
producer_name: "pytorch"
producer_version: "0.4"
graph {
  node {
    output: "2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: DOUBLE
        raw_data: "\000\000\000\000\000\000\360?"
      }
      type: TENSOR
    }
  }
  node {
    input: "1"
    input: "2"
    output: "3"
    op_type: "Add"
  }
  name: "torch-jit-export"
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "3"
    type {
      tensor_type {
        elem_type: DOUBLE
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
