ir_version: 3
producer_name: "pytorch"
producer_version: "0.4"
graph {
  node {
    input: "1"
    output: "2"
    op_type: "Upsample"
    attribute {
      name: "mode"
      s: "bilinear"
      type: STRING
    }
    attribute {
      name: "scales"
      floats: 1
      floats: 1
      floats: 2
      floats: 2
      type: FLOATS
    }
  }
  name: "torch-jit-export"
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
