ir_version: 3
producer_name: "pytorch"
producer_version: "0.4"
graph {
  node {
    input: "1"
    output: "2"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 2
      type: INTS
    }
  }
  name: "torch-jit-export"
  input {
    name: "1"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "2"
    type {
      tensor_type {
        elem_type: FLOAT
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
